hrs = input("Enter Hours:")
rate = input("What is your FCK rate?:")
h = float(hrs)
r = float(rate)
ro = float(10.50 * 1.5)
if h <= 40 :
    z = h * r
    print(float (z))
elif h >= 41 :
    o = ((h - 40) * ro) + (40 * r)
    print(float (o))

    # Запитуємо кількість годин та ставку на годину у користувача
hrs = input("Введіть кількість робочих годин: ")
rate = input("Введіть ставку на годину: ")

# Перетворюємо введені значення на числа з плаваючою точкою
h = float(hrs)
r = float(rate)

# Обчислюємо оплату
if h <= 40:
    # Якщо відпрацьовано 40 або менше годин, оплата за стандартною ставкою
    z = h * r
else:
    # Якщо відпрацьовано більше 40 годин, оплата за стандартною ставкою за перші 40 годин
    # і 1.5-кратною ставкою за години понад 40
    z = (40 * r) + ((h - 40) * r * 1.5)

# Виводимо результат
print("Номінальна заробітна плата: ", z)
